output/dot/1.dot
digraph
{
   _01 [ label = "VARARGPREP 0" ];
   _02 [ label = "GETTABUP 0 0 0" ];
   _03 [ label = "LOADK 1 1" ];
   _04 [ label = "CALL 0 2 2" ];
   _05 [ label = "GETTABUP 1 0 0" ];
   _06 [ label = "LOADK 2 2" ];
   _07 [ label = "CALL 1 2 2" ];
   _08 [ label = "GETTABUP 2 0 0" ];
   _09 [ label = "LOADK 3 3" ];
   _10 [ label = "CALL 2 2 2" ];
   _11 [ label = "GETTABUP 3 0 0" ];
   _12 [ label = "LOADK 4 4" ];
   _13 [ label = "CALL 3 2 2" ];
   _14 [ label = "CLOSURE 4 0" ];
   _15 [ label = "LOADNIL 5 0" ];
   _16 [ label = "CLOSURE 6 1" ];
   _17 [ label = "MOVE 5 6" ];
   _18 [ label = "CLOSURE 6 2" ];
   _19 [ label = "RETURN 6 2 1k" ];
   _20 [ label = "RETURN 7 1 1k" ];

   _01 -> _02 -> _03 -> _04 -> _05 -> _06 -> _07 -> _08 ->
      _09 -> _10 -> _11 -> _12 -> _13 -> _14 -> _15 -> _16 ->
      _17 -> _18 -> _19;
}
