output/mmd/1.mmd
flowchart TD
  _01["VARARGPREP 0"]
  _02["GETTABUP 0 0 0"]
  _03["LOADK 1 1"]
  _04["CALL 0 2 2"]
  _05["GETTABUP 1 0 0"]
  _06["LOADK 2 2"]
  _07["CALL 1 2 2"]
  _08["GETTABUP 2 0 0"]
  _09["LOADK 3 3"]
  _10["CALL 2 2 2"]
  _11["GETTABUP 3 0 0"]
  _12["LOADK 4 4"]
  _13["CALL 3 2 2"]
  _14["CLOSURE 4 0"]
  _15["LOADNIL 5 0"]
  _16["CLOSURE 6 1"]
  _17["MOVE 5 6"]
  _18["CLOSURE 6 2"]
  _19["RETURN 6 2 1k"]
  _20["RETURN 7 1 1k"]

  _01 --> _02 --> _03 --> _04 --> _05 --> _06 --> _07 --> _08
  _08 --> _09 --> _10 --> _11 --> _12 --> _13 --> _14 --> _15
  _15 --> _16 --> _17 --> _18 --> _19
